app/Http/Controllers/FrontendController.php

    public function index()
    {

        // Mencatat kunjungan setiap kali pengguna mengunjungi halaman home
        Visit::create([
            'ip_address' => request()->ip(),      // Mengambil IP address pengguna
            'user_agent' => request()->userAgent(), // Mengambil User Agent pengguna
        ]);
        $posts = Post::with('category', 'author')->latest()->paginate(0);
$categories = Category::all();
$authors = User::where('role', 'author')->get();
$popularPosts = Post::orderBy('views', 'desc')->take(4)->get(); // Contoh, ambil 4 post populer
$adminPosts = Post::whereHas('author', function ($query) {
    $query->where('role', 'admin'); // Pastikan kolom 'role' ada di tabel 'users'
})->latest()->take(4)->get();

// Ambil semua postingan dari author dengan paginasi 8
$authorPosts = Post::whereHas('author', function ($query) {
    $query->where('role', 'author'); // Menentukan role author
})->latest()->paginate(8); // Ambil semua post author dengan paginasi 8
---
insert into `visits` (`ip_address`, `user_agent`, `updated_at`, `created_at`) values ('127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36', '2024-12-27 13:53:13', '2024-12-27 13:53:13')
select * from `categories` where `categories`.`id` in (6, 7, 8, 9, 10)
select count(*) as aggregate from `posts`
select * from `categories`
select * from `users` where `role` = 'author'
select * from `posts` order by `views` desc limit 4
select * from `posts` where exists (select * from `users` where `posts`.`author_id` = `users`.`id` and `role` = 'admin') order by `created_at` desc limit 4
select * from `posts` where exists (select * from `users` where `posts`.`author_id` = `users`.`id` and `role` = 'author') order by `created_at` desc limit 8 offset 0
select count(*) as aggregate from `posts` where exists (select * from `users` where `posts`.`author_id` = `users`.`id` and `role` = 'author')